{
  "world_races": {
    "elf_h": {
      "race_id": "elf_h",
      "race_name": "High Elf",
      "race_description": {
        "general_overview": "Uma raça antiga e mística, profundamente conectada com as florestas e a natureza. Elfos são seres de notável longevidade e agilidade, possuindo uma ligação intrínseca e poderosa com a magia. Distinguem-se por sua beleza etérea e uma sabedoria que transcende gerações, acumulada ao longo de suas vastas existências.",
        "cultural_values": "A cultura élfica valoriza acima de tudo a harmonia com o ambiente natural, a arte, a música e a busca incessante pelo conhecimento. Eles respeitam profundamente a ancestralidade e transmitem saberes através de tradições orais e rituais antigos. A paciência e a contemplação são virtudes altamente estimadas.",
        "social_behavior": "Elfos tendem a ser reservados e cautelosos com estranhos, especialmente com raças mais jovens e impulsivas. Preferem viver em comunidades isoladas e harmoniosas, muitas vezes ocultas nas florestas mais antigas. Quando se abrem, demonstram lealdade profunda e um senso de comunidade inabalável. Raramente buscam confrontos diretos, preferindo a diplomacia ou a evasão.",
        "typical_abilities_and_skills": "São exímios em magia, com aptidão natural para encantamentos, cura e controle elemental. Possuem habilidades superiores em arquearia e caça, movendo-se com silêncio e precisão inigualáveis. Sua conexão com a fauna e flora lhes confere um dom para a domesticação de animais e a manipulação de plantas."
      },
      "race_appearence_description": "Elfos possuem orelhas pontudas, pele clara e olhos brilhantes que refletem a luz de maneira única. Sua estatura é geralmente mais alta do que a média humana, e seus movimentos são graciosos e fluidos. Vestem-se com roupas leves e naturais, muitas vezes adornadas com elementos da floresta",
      "race_lore": "Elfos são conhecidos por sua habilidade em magia, especialmente em encantamentos e cura. Eles também são exímios arqueiros e caçadores, com uma conexão especial com a fauna e flora ao seu redor. Sua cultura valoriza a harmonia com a natureza e o conhecimento"
    },
    "orc": {
      "race_id": "orc",
      "race_name": "Orc",
      "race_description": {
        "general_overview": "Uma raça robusta e pragmática, forjada em terras áridas e conflitos constantes. Orcs são conhecidos por sua força física formidável, resiliência e uma cultura tribal que valoriza a honra em combate e a força da comunidade. Embora frequentemente mal compreendidos, possuem uma lealdade feroz aos seus clãs.",
        "cultural_values": "A cultura orcish prioriza a força, a honra, a lealdade ao clã e a sobrevivência em ambientes hostis. Eles respeitam a hierarquia baseada na força e na sabedoria dos líderes de clã. A arte da guerra e a forja de armas são consideradas formas elevadas de expressão cultural e sobrevivência.",
        "social_behavior": "Orcs são geralmente diretos e, por vezes, agressivos em sua comunicação. Tendem a ser desconfiados de forasteiros e raças não-orcish, mas formam laços inquebráveis com aqueles que provam seu valor ou pertencem ao seu clã. A hospitalidade é rara, mas a aliança forjada em batalha é sagrada. Preferem a ação à diplomacia excessiva.",
        "typical_abilities_and_skills": "São exímios guerreiros, proficientes no uso de armas pesadas e táticas de combate corpo a corpo. Possuem grande resistência à dor e à fadiga. Habilidades em forja, caça de grandes feras e construção de fortificações são comuns. Alguns possuem uma conexão rudimentar com magias xamânicas."
      },
      "race_appearence_description": "Orcs possuem pele esverdeada ou acinzentada e mandíbulas proeminentes com presas inferiores que se projetam. Sua estatura é geralmente robusta e musculosa, com ombros largos e uma postura imponente. Os olhos são frequentemente pequenos e vermelhos ou amarelos. Vestem armaduras pesadas e peles de animais, adornadas com cicatrizes de batalha e troféus.",
      "race_lore": "Os Orcs surgiram das profundezas da terra em eras de grande conflito, forjando suas tribos em meio a vulcões e desertos. Sua história é marcada por migrações em massa, batalhas territoriais e a busca incessante por um lugar onde possam prosperar. Conhecidos por seu poderio militar, construíram impérios tribais que desafiaram as maiores civilizações, apesar de sua fama de selvagens."
    },
    "dwarf": {
      "race_id": "dwarf",
      "race_name": "Dwarf",
      "race_description": {
        "general_overview": "Uma raça robusta e resiliente, nascida das montanhas e com uma conexão inabalável com a pedra e o metal. Anões são mestres artesãos, mineiros e guerreiros, conhecidos por sua teimosia, honestidade e apreço por tradições milenares. Possuem uma longa vida e uma grande paixão por seus clãs e sua ancestralidade.",
        "cultural_values": "A cultura anã valoriza a honra, o trabalho árduo, a lealdade ao clã, a perícia artesanal e a riqueza material (especialmente metais preciosos e gemas). Respeitam a palavra dada, a honestidade e a sabedoria dos anciãos. A tradição e a história de seu povo são reverenciadas acima de tudo.",
        "social_behavior": "Anões podem ser rudes e desconfiados de forasteiros no início, mas uma vez que sua confiança é ganha, são leais amigos e aliados. Preferem a companhia de seu próprio povo em fortalezas subterrâneas e têm pouca paciência para frivolidades ou mentiras. Sua comunicação é direta e sem rodeios, por vezes parecendo brusca.",
        "typical_abilities_and_skills": "São incomparáveis em mineração, metalurgia e forja, capazes de criar armas e armaduras de qualidade lendária. Possuem grande resistência física, especialmente contra venenos e magia. São guerreiros formidáveis em espaços fechados e mestres na construção de túneis e fortalezas. Muitos têm aptidão para engenharia mecânica e tática de cerco."
      },
      "race_appearence_description": "Anões possuem uma estatura compacta e atarracada, mas são incrivelmente fortes e musculosos. Sua pele é geralmente morena ou bronzeada, e seus cabelos e barbas (que são muito valorizados, especialmente pelos machos) variam de castanho a ruivo, por vezes pretos ou grisalhos. Seus olhos são frequentemente pequenos, mas penetrantes, em tons de azul, cinza ou marrom. Vestem roupas práticas e resistentes, muitas vezes com armaduras de metal e ferramentas presas ao corpo.",
      "race_lore": "Os Anões têm sua origem nas profundezas das montanhas mais antigas, onde construíram vastas cidades subterrâneas adornadas com sua arte e engenharia. Sua história é uma saga de grandes minerações, descoberta de tesouros lendários e guerras épicas contra criaturas das profundezas. Guardiões de segredos antigos e protetores de reinos sob a terra, eles mantêm uma memória coletiva de seus ancestrais que guia cada aspecto de sua existência."
    }
  }
}