{
  "race_id": "elf",
  "race_name": "Elf",
  "race_description": {
    "general_overview": "Uma raça antiga e mística, profundamente conectada com as florestas e a natureza. Elfos são seres de notável longevidade e agilidade, possuindo uma ligação intrínseca e poderosa com a magia. Distinguem-se por sua beleza etérea e uma sabedoria que transcende gerações, acumulada ao longo de suas vastas existências.",
    "cultural_values": "A cultura élfica valoriza acima de tudo a harmonia com o ambiente natural, a arte, a música e a busca incessante pelo conhecimento. Eles respeitam profundamente a ancestralidade e transmitem saberes através de tradições orais e rituais antigos. A paciência e a contemplação são virtudes altamente estimadas.",
    "social_behavior": "Elfos tendem a ser reservados e cautelosos com estranhos, especialmente com raças mais jovens e impulsivas. Preferem viver em comunidades isoladas e harmoniosas, muitas vezes ocultas nas florestas mais antigas. Quando se abrem, demonstram lealdade profunda e um senso de comunidade inabalável. Raramente buscam confrontos diretos, preferindo a diplomacia ou a evasão.",
    "typical_abilities_and_skills": "São exímios em magia, com aptidão natural para encantamentos, cura e controle elemental. Possuem habilidades superiores em arquearia e caça, movendo-se com silêncio e precisão inigualáveis. Sua conexão com a fauna e flora lhes confere um dom para a domesticação de animais e a manipulação de plantas."
  },
  "race_appearence_description": "Elfos possuem orelhas pontudas, pele clara e olhos brilhantes que refletem a luz de maneira única. Sua estatura é geralmente mais alta do que a média humana, e seus movimentos são graciosos e fluidos. Vestem-se com roupas leves e naturais, muitas vezes adornadas com elementos da floresta"
  "race_lore": "Elfos são conhecidos por sua habilidade em magia, especialmente em encantamentos e cura. Eles também são exímios arqueiros e caçadores, com uma conexão especial com a fauna e flora ao seu redor. Sua cultura valoriza a harmonia com a natureza e o conhecimento"
}